app/controllers/friends_controller.rb

  def index
    @friends = Friend.all.paginate(:page => params[:page], :per_page => 6)
---
SELECT  "friends".* FROM "friends" LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "friends"

  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("name", "address", "email", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)