app/controllers/purchases_controller.rb

  def create
    @purchase = Purchase.new(purchase_params)

    respond_to do |format|
      if @purchase.save
---
INSERT INTO "purchases" ("product", "valor", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product", "Teclado Optico"], ["valor", 79.99], ["amount", 2], ["created_at", "2017-03-07 19:41:51.104089"], ["updated_at", "2017-03-07 19:41:51.104089"]]